package lesson_08.homework_08;

public class Task2 {
  public static void main(String[] args) {
    // Используйте цикл while для решения задачи:
    // Распечатайте 10 строк: "Task1", "Task2", ..., "Task10".

    int i = 0;
    while (i < 10) {
      i++;
      System.out.println("Task" + i);
    }

  }

  public static class Task6 {
    public static void main(String[] args) {
      // Создать массив целых чисел произвольной длины от 5 до 15. Заполнить массив случайными значениями от -50 до 50.


      //Вывести на экран:
      //
      //Минимальное значение в массиве
      //Максимальное значение в массиве
      //Среднее арифметическое всех значений в массиве
    }
  }
}
