## Домашнее задание

### Задача 1
Дан текст `Programming is fun`.
Напишите программу, которая проверяет, содержит ли эта строка слово “fun”, и выведите результат в виде булевой переменной.

### Задача 2
Создайте две переменные типа `int`.
- В первую переменную запишите случайное значение от 0 до 50.
- Во вторую переменную случайное значение от 0 до 100.
- - (опционально) Во вторую переменную случайное значение от -20 до 30.
    Проверьте:
- равны ли переменные,
- не равны ли они,
- больше ли a, чем b,
- и меньше ли b, чем a.
- Выведите результат на экран.

### Задача 3
1. Попросите пользователя ввести целое число с клавиатуры.
2. Ваша программа должна вывести строку в формате:
```none
Число: 6 четное: true; кратно 3: true; четное и кратное 3: true
Число: 3 четное: false; кратно 3: true; четное и кратное 3: false
```
3. Проверьте работу вашей программы, вводя разные числа. Убедитесь в правильности выдаваемой строки.

### Задача 4
Дан следующий код. Вашей задачей является предсказать, какой вывод будет напечатан в консоли после выполнения программы.
```java
public class BooleanTest {
    public static void main(String[] args) {
        int a = 8;
        int b = 3;
        boolean result;

        result = (a + b) > 10;
        System.out.println("Result 1: " + result);

        result = (a - b) == 5;
        System.out.println("Result 2: " + result);

        result = (a * b) != 24;
        System.out.println("Result 3: " + result);

        result = (a / b) >= 2;
        System.out.println("Result 4: " + result);

        result = !(a % b == 2);
        System.out.println("Result 5: " + result);
    }
}
```

Предскажите, что будет выведено на консоль для Result 1 до Result 5. Объясните кратко свой ответ.
